<template>
  <div>
    <div class="about">
      <p>
        Добро пожаловать в наш магазин виниловых пластинок — место, где музыка
        оживает! Мы — команда энтузиастов, объединенных любовью к винилу и
        стремлением делиться с вами удивительным миром музыки.Наша история
        началась с простого увлечения коллекционированием пластинок, и с тех пор
        мы превратили нашу страсть в бизнес. Мы тщательно отбираем каждую
        пластинку, чтобы предложить вам только лучшие альбомы из разных жанров и
        эпох. От классического рока до современного инди, от джаза до
        электроники — у нас есть что-то для каждого меломана.
      </p>
      <img :src="'img/about1.svg'" alt="" />
    </div>
    <div class="about" id="block2">
      <img :src="'img/about2.svg'" alt="" />
      <p>
        Мы гордимся тем, что поддерживаем местных артистов и независимые лейблы,
        предоставляя им платформу для продвижения их музыки. В нашем магазине вы
        найдете не только популярные хиты, но и редкие издания, которые порадуют
        истинных ценителей. Кроме того, мы проводим регулярные мероприятия:
        прослушивания, встречи с музыкантами и мастер-классы по уходу за
        винилом. Наша цель — создать сообщество людей, объединенных любовью к
        музыке и винилу.Приходите к нам, исследуйте нашу коллекцию и найдите
        свою идеальную пластинку. Мы уверены, что каждая запись расскажет вам
        свою уникальную историю. Спасибо, что выбираете нас — давайте вместе
        сделаем музыку частью вашей жизни!
      </p>
    </div>
  </div>
</template>

<style scoped>
.about {
  height: 540px;
  gap: 60px;
  margin: 0px 68px 40px 68px;
  display: flex;
  font-weight: 500;
  font-size: 24px;
  align-items: center;
  text-align: justify;
  color: #000;
  font-family: "Martian Mono", serif;
}

#block2 {
  margin-top: 24px;
}
@media (min-width: 320px) and (max-width: 767px) {
  .about {
    height: 200px;
    gap: 2px;
    margin: 0px 5px 20px 5px;
    font-weight: 500;
    font-size: 8px;
  }
  .about > img {
    width: 100px;
  }
}
@media (min-width: 768px) and (max-width: 1023px) {
    .about {
    height: 200px;
    gap: 2px;
    margin: 0px 5px 20px 5px;
    font-weight: 500;
    font-size: 12px;
  }
  .about > img {
    width: 200px;
  }
}
@media (min-width: 1024px) and (max-width: 1440px) {
      .about {
    height: 250px;
    gap: 12px;
    margin: 0px 15px 30px 15px;
    font-weight: 500;
    font-size: 14px;
  }
  .about > img {
    width: 250px;
  }
}
</style>